Tekla.Structures.ModelInternal.TeklaStructuresApplication
Provides access to TS functionality tied to the process.

Tekla.Structures.ModelInternal.TeklaStructuresApplication.handlersWrapper
Wrapper dictionary for Tekla.Structures.ModelInternal.TeklaStructuresApplication.SharedModelStateChanged event handlers, to ensure remoting failures are handled.

Tekla.Structures.ModelInternal.TeklaStructuresApplication.SharedModelStateChanged


Tekla.Structures.ModelInternal.TeklaStructuresApplication.GetSharingLocalChangesCallback
Sharing location changes callback.

Tekla.Structures.ModelInternal.TeklaStructuresApplication.GetTCProjectsWithPointCloudsCallback
Trimble Connect projects with point clouds callback.

Tekla.Structures.ModelInternal.TeklaStructuresApplication.GetTCPointCloudUrlCallback
Trimble Connect Point cloud URL callback.

Tekla.Structures.ModelInternal.TeklaStructuresApplication.SharingCalls
Sets the sharing calls implementation.

Tekla.Structures.ModelInternal.TeklaStructuresApplication.Tekla#Structures#ModelInternal#ITeklaStructuresApplication#BeginGetSharingLocalChanges(Tekla.Structures.Internal.IAsyncCallCompletion{System.Collections.Generic.Dictionary{System.String,System.Collections.Generic.List{Tekla.Structures.ModelInternal.HistoryItem}}})
Begins the asynchronous operation to get sharing local changes.
endCallback:
The callback to invoke when the operation completes. The callback receives a System.Collections.Generic.Dictionary`2
where the key is a string and the value is a list of Tekla.Structures.ModelInternal.HistoryItem representing the local changes.
Throws System.ArgumentNullException:
Thrown if endCallback is null.

Tekla.Structures.ModelInternal.TeklaStructuresApplication.Tekla#Structures#ModelInternal#ITeklaStructuresApplication#BeginGetTCProjectsWithPointClouds(Tekla.Structures.Internal.IAsyncCallCompletion{System.Collections.Generic.IEnumerable{Tekla.Structures.Model.PointCloudDataServices.TCProject}})
Begins the asynchronous operation to get Trimble Connect projects that have associated point clouds.
endCallback:
The callback to invoke when the operation completes. The callback receives an System.Collections.Generic.IEnumerable`1
containing the Trimble Connect projects with point clouds.
Throws System.ArgumentNullException:
Thrown if endCallback is null.

Tekla.Structures.ModelInternal.TeklaStructuresApplication.Tekla#Structures#ModelInternal#ITeklaStructuresApplication#BeginGetTCPointCloudUrl(System.String,System.String,System.String,Tekla.Structures.Internal.IAsyncCallCompletion{System.String})
Begins the asynchronous operation to get the Trimble Connect point cloud URL.
projectId: The identifier of the Trimble Connect project.
regionalUrl: The regional URL associated with the project.
pointCloudId: The identifier of the point cloud.
endCallback:
The callback to invoke when the operation completes. The callback receives a System.String
representing the URL of the point cloud.
Throws System.ArgumentNullException:
Thrown if endCallback is null.

Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginTestSharingOperationAsync(System.Boolean,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginInviteSharingUserAsync(System.String,Tekla.Structures.Model.SharingRole,System.Boolean,System.String,System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginGetSharedModelsAsync(Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{System.Collections.Generic.IEnumerable{Tekla.Structures.ModelInternal.SharedModel}}})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginStartSharingAsync(System.String,System.String,System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{System.Guid}})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginGetLocationsAsync(Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{Tekla.Structures.ModelInternal.SharingLocationsInformation}})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginRemoveModelAsync(System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginGetSharingUpdatesAsync(System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{System.Collections.Generic.List{Tekla.Structures.ModelInternal.SharingUpdate}}})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginJoinSharedModelAsync(System.Guid,System.String,System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginReadInAsync(System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginWriteOutAsync(System.String,System.String,System.Boolean,System.String,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginReserveNextWriteOutAsync(System.String,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.BeginReleaseNextWriteOutAsync(System.String,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})


Tekla.Structures.ModelInternal.TeklaStructuresApplication.GetContinuation``1(Tekla.Structures.Internal.IAsyncCallCompletion{``0},System.String)
Consinuation that wraps task running result.
The return type of the task.
endCallback: The end callback.
callerName: The calling function name.
Returns: Action which needs to be used for System.Threading.Tasks.Task.ContinueWith(System.Action{System.Threading.Tasks.Task})